export const RegUtil = {
  UTC: /\d{4}-(?:0[1-9]|1[0-2])-(?:0[1-9]|[1-2]\d|3[0-1])T(?:[0-1]\d|2[0-3]):[0-5]\d:[0-5]\d(?:\.\d+|)(?:Z|(?:\+|-)(?:\d{2}):?(?:\d{2}))/gm,
  EMAIL:
    /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  EMAIL_NO_SPECIAL_CHAR: /^[\w-.]+@([\w-]+\.)+[\w-]{2,4}$/g,
  NO_SPECICAL_CHARACTER: /^[a-zA-Z0-9]*$/,
  NUMBER_AND_CHARACTER: /^(?=.*?\d)(?=.*?[a-zA-Z])[a-zA-Z\d]{7,}$/,
  HEX_COLOR: /^([a-zA-Z0-9]{6,})*$/,
  FLOATREG: /^\d*(\.\d*)?$/,
  NUMBERREG: /^[0-9\b]+$/,
  WEBSITE_URL: /^(?:http(s)?:\/\/)?[\w.-]+(?:\.[\w.-]+)+[\w\-._~:/?#[\]@!$&'()*+,;=.]+$/,
  STRINGUTF8:
    /^[a-zA-Z0-9_,\-ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀẾỂưăạảấầẩẫậắằẳẵặẹẻẽềềểếỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵýỷỹ ]+$/,
  NO_ALL_SPACE:
    /^[a-zA-Z0-9_\-ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀẾỂưăạảấầẩẫậắằẳẵặẹẻẽềếềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵýỷỹ]+[a-zA-Z0-9_\-ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵýỷỹ\s]*$/,
  SUFIX_POINT: /(\d)(?=(\d{3})+(?!\d))/g,
  // PHONE: /^[0-9\\+]([0-9]{8,14})$/,
  PHONE: /^((\+84|84|0084|0)[1-9]{1}[0-9]{8,9})$/,
  PHONE_HOTLINE: /^\+?[0-9]{8,14}$/,
  WEBSITE_URL_2:
    /^(?:http(s)?:\/\/)?[\w.-]+(?:\.[\w\\.-]+)+[\w\-\\._~:/?#[\]@!\\$&'\\(\\)\\*\\+,;=.]+$/gm,
  ONLY_STRING: /^[a-zA-Z\b]+$/,
  // BOTH_NUMBER_AND_STRING: /(?=.*[A-Z])(?=.*[0-9])/,
  BOTH_NUMBER_AND_STRING: /^(?=.*?\d)(?=.*?[a-zA-Z])[a-zA-Z\d]+$/,
  ONLY_NUMBER: /^[0-9]+$/,
  BARCODE_NUMBER: /^[0-9]{13}$/,
  NO_SPECICAL_CHARACTER_MATERIAL: /^[-a-zA-Z0-9]*$/,
  /** match strings that contains white space charracters like \n, \t, \r, space */
  WHITE_SPACE: /\s/,
};
