export const RegUtil = {
  UTC: /\d{4}-(?:0[1-9]|1[0-2])-(?:0[1-9]|[1-2]\d|3[0-1])T(?:[0-1]\d|2[0-3]):[0-5]\d:[0-5]\d(?:\.\d+|)(?:Z|(?:\+|-)(?:\d{2}):?(?:\d{2}))/gm,
  EMAIL: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  NO_SPECICAL_CHARACTER: /^[a-zA-Z0-9]*$/,
  HEX_COLOR: /^([a-zA-Z0-9]{6,})*$/,
  FLOATREG:  /^-?\d*(\.\d*)?$/,
  NUMBERREG: /^[0-9\b]+$/,
  STRINGUTF8: /^[a-zA-Z0-9_\-ÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ ]+$/,
  NO_ALL_SPACE: /^[a-zA-Z0-9]+[a-zA-Z0-9\s]*$/,
  SUFIX_POINT:/(\d)(?=(\d{3})+(?!\d))/g,
}